Documents/УведомлениеОНачалеОтпуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УведомлениеОНачалеОтпуска</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Отпуска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОтпуска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УведомлениеОНачалеОтпуска/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаФизическоеЛицоВШапке();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.УведомлениеОНачалеОтпуска";
	КомандаПечати.Идентификатор = "ПФ_MXL_УведомлениеОНачалеОтпуска";
	КомандаПечати.Представление = НСтр("ru = 'Уведомление'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_УведомлениеОНачалеОтпуска") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ПФ_MXL_УведомлениеОНачалеОтпуска", 
			НСтр("ru = 'Уведомление о начале отпуска'"), 
			ПечатнаяФормаУведомлениеОНачалеОтпуска(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатнаяФормаУведомлениеОНачалеОтпуска(МассивОбъектов, ОбъектыПечати) Экспорт 
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УведомлениеОНачалеОтпуска";
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ВыборкаПоШапкеДокумента = ЗапросПоШапкеДляПечати(МассивОбъектов).Выбрать();
	ВыборкаПоОтпускам = ЗапросПоОтпускамДляПечати(МассивОбъектов).Выбрать();
	
	Пока ВыборкаПоШапкеДокумента.СледующийПоЗначениюПоля("Ссылка") Цикл 
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.УведомлениеОНачалеОтпуска.ПФ_MXL_УведомлениеОНачалеОтпуска");
		
		НачалоФормы = ДокументРезультат.ВысотаТаблицы + 1;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьВидОтпуска = Макет.ПолучитьОбласть("ВидОтпуска");
		
		ОбластьШапка.Параметры.НаименованиеОрганизации = ВыборкаПоШапкеДокумента.НаименованиеОрганизации;
		ОбластьШапка.Параметры.Год = СтрЗаменить(Год(ВыборкаПоШапкеДокумента.ДатаНачала), Символы.НПП, "");
		ОбластьШапка.Параметры.ОтпускПредставление = НСтр("ru = 'отпуск'");
		ОбластьШапка.Параметры.НаименованиеОрганизации = ВыборкаПоШапкеДокумента.НаименованиеОрганизации;
		ОбластьШапка.Параметры.ПодразделениеСотрудника = Строка(ВыборкаПоШапкеДокумента.Подразделение);
		ОбластьШапка.Параметры.ДолжностьСотрудника = Строка(ВыборкаПоШапкеДокумента.Должность);
		ОбластьШапка.Параметры.ФИОСотрудника = ВыборкаПоШапкеДокумента.ФИОСотрудника;
		ОбластьШапка.Параметры.ДатаНачала = Формат(ВыборкаПоШапкеДокумента.ДатаНачала, "ДЛФ=Д");
		ОбластьШапка.Параметры.ДатаОкончания = Формат(ВыборкаПоШапкеДокумента.ДатаОкончания, "ДЛФ=Д");
		
		Если ВыборкаПоШапкеДокумента.КоличествоВидовОтпусков = 1 Тогда 
			ОбластьШапка.Параметры.ОтпускПредставление = ?(ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.НаименованиеВидаОтпуска),
				ВыборкаПоШапкеДокумента.НаименованиеВидаОтпуска, Строка(ВыборкаПоШапкеДокумента.ВидОтпуска));
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьШапка);
		
		ВыборкаПоОтпускам.Сбросить();
		
		Если ВыборкаПоШапкеДокумента.КоличествоВидовОтпусков > 1
			И ВыборкаПоОтпускам.НайтиСледующий(Новый Структура("Ссылка", ВыборкаПоШапкеДокумента.Ссылка)) Тогда
			
			ВыборкаПоОтпускам.СледующийПоЗначениюПоля("Ссылка");
			
			Пока ВыборкаПоОтпускам.Следующий() Цикл
				
				ОбластьВидОтпуска.Параметры.ВидОтпуска = ?(ЗначениеЗаполнено(ВыборкаПоОтпускам.НаименованиеВидаОтпуска),
					ВыборкаПоОтпускам.НаименованиеВидаОтпуска, Строка(ВыборкаПоОтпускам.ВидОтпуска));
				ОбластьВидОтпуска.Параметры.ДатаНачала = Формат(ВыборкаПоОтпускам.ДатаНачала, "ДЛФ=Д");
				ОбластьВидОтпуска.Параметры.ДатаОкончания = Формат(ВыборкаПоОтпускам.ДатаОкончания, "ДЛФ=Д");
				
				ДокументРезультат.Вывести(ОбластьВидОтпуска);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ОбластьПодвал.Параметры.ДатаУведомления = Формат(ВыборкаПоШапкеДокумента.Дата, "ДЛФ=Д");
		ОбластьПодвал.Параметры.ДолжностьРуководителя = Строка(ВыборкаПоШапкеДокумента.ДолжностьРуководителя);
		ОбластьПодвал.Параметры.РуководительРасшифровкаПодписи = ВыборкаПоШапкеДокумента.РуководительРасшифровкаПодписи;
		ОбластьПодвал.Параметры.ФИОСотрудника = ВыборкаПоШапкеДокумента.ФИОСотрудника;
		
		ДокументРезультат.Вывести(ОбластьПодвал);
		
	    ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НачалоФормы, ОбъектыПечати, ВыборкаПоШапкеДокумента.Ссылка);
		
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции

Функция ЗапросПоШапкеДляПечати(МассивСсылок)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УведомлениеОНачалеОтпуска.Дата КАК Дата,
		|	УведомлениеОНачалеОтпуска.Номер КАК Номер,
		|	УведомлениеОНачалеОтпуска.Организация КАК Организация,
		|	УведомлениеОНачалеОтпуска.Сотрудник КАК Сотрудник,
		|	УведомлениеОНачалеОтпуска.Ссылка КАК Ссылка,
		|	УведомлениеОНачалеОтпуска.Руководитель КАК Руководитель,
		|	УведомлениеОНачалеОтпуска.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	УведомлениеОНачалеОтпуска.ДатаНачала КАК ДатаНачала,
		|	УведомлениеОНачалеОтпуска.ДатаОкончания КАК ДатаОкончания,
		|	МАКСИМУМ(УведомлениеОНачалеОтпускаОтпуска.ВидОтпуска) КАК ВидОтпуска,
		|	МАКСИМУМ(ЕСТЬNULL(УведомлениеОНачалеОтпускаОтпуска.ВидОтпуска.НаименованиеПолное, """")) КАК НаименованиеВидаОтпуска,
		|	КОЛИЧЕСТВО(УведомлениеОНачалеОтпускаОтпуска.ВидОтпуска) КАК КоличествоВидовОтпусков
		|ПОМЕСТИТЬ ВТДанныеДокументов
		|ИЗ
		|	Документ.УведомлениеОНачалеОтпуска КАК УведомлениеОНачалеОтпуска
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОНачалеОтпуска.Отпуска КАК УведомлениеОНачалеОтпускаОтпуска
		|		ПО УведомлениеОНачалеОтпуска.Ссылка = УведомлениеОНачалеОтпускаОтпуска.Ссылка
		|ГДЕ
		|	УведомлениеОНачалеОтпуска.Ссылка В(&МассивСсылок)
		|
		|СГРУППИРОВАТЬ ПО
		|	УведомлениеОНачалеОтпуска.Дата,
		|	УведомлениеОНачалеОтпуска.Номер,
		|	УведомлениеОНачалеОтпуска.Организация,
		|	УведомлениеОНачалеОтпуска.Сотрудник,
		|	УведомлениеОНачалеОтпуска.Ссылка,
		|	УведомлениеОНачалеОтпуска.Руководитель,
		|	УведомлениеОНачалеОтпуска.ДолжностьРуководителя,
		|	УведомлениеОНачалеОтпуска.ДатаНачала,
		|	УведомлениеОНачалеОтпуска.ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДокументов.Сотрудник КАК Сотрудник,
		|	ДанныеДокументов.Дата КАК Период
		|ПОМЕСТИТЬ ВТСотрудникиПериоды
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов";
	
	Запрос.Выполнить();
	
	ИменаПолейОтветственныхЛиц = Новый Массив;
	ИменаПолейОтветственныхЛиц.Добавить("Руководитель");
	ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Истина, ИменаПолейОтветственныхЛиц, "ВТДанныеДокументов");
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиПериоды");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, "ФИОПолные,Должность,Подразделение");
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокументов.Дата КАК Дата,
		|	ДанныеДокументов.Номер КАК Номер,
		|	ДанныеДокументов.Организация КАК Организация,
		|	ДанныеДокументов.Сотрудник КАК Сотрудник,
		|	ДанныеДокументов.Ссылка КАК Ссылка,
		|	ДанныеДокументов.Руководитель КАК Руководитель,
		|	ДанныеДокументов.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	ДанныеДокументов.ДатаНачала КАК ДатаНачала,
		|	ДанныеДокументов.ДатаОкончания КАК ДатаОкончания,
		|	ДанныеДокументов.КоличествоВидовОтпусков КАК КоличествоВидовОтпусков,
		|	ДанныеДокументов.ВидОтпуска КАК ВидОтпуска,
		|	ДанныеДокументов.НаименованиеВидаОтпуска КАК НаименованиеВидаОтпуска,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(Организации.НаименованиеПолное, 1, 10) <> """"
		|			ТОГДА Организации.НаименованиеПолное
		|		ИНАЧЕ Организации.Наименование
		|	КОНЕЦ КАК НаименованиеОрганизации,
		|	Организации.НаименованиеПолное КАК НаименованиеПолное,
		|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
		|	КадровыеДанные.ФИОПолные КАК ФИОСотрудника,
		|	КадровыеДанные.Должность КАК Должность,
		|	КадровыеДанные.Подразделение КАК Подразделение,
		|	ФИООтветственныхЛиц.РасшифровкаПодписи КАК РуководительРасшифровкаПодписи
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ДанныеДокументов.Организация = Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИООтветственныхЛиц
		|		ПО ДанныеДокументов.Руководитель = ФИООтветственныхЛиц.ФизическоеЛицо
		|			И ДанныеДокументов.Ссылка = ФИООтветственныхЛиц.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанные
		|		ПО ДанныеДокументов.Сотрудник = КадровыеДанные.Сотрудник
		|			И ДанныеДокументов.Дата = КадровыеДанные.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеДокументов.Дата,
		|	Ссылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ЗапросПоОтпускамДляПечати(МассивСсылок)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.НомерСтроки КАК НомерСтроки,
		|	Сотрудники.ВидОтпуска КАК ВидОтпуска,
		|	Сотрудники.ДатаНачала КАК ДатаНачала,
		|	Сотрудники.ДатаОкончания КАК ДатаОкончания,
		|	Сотрудники.ВидОтпуска.НаименованиеПолное КАК НаименованиеВидаОтпуска
		|ИЗ
		|	Документ.УведомлениеОНачалеОтпуска.Отпуска КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В(&МассивСсылок)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ИдентификаторКомандыПечатиЗаявления() Экспорт
	
	Возврат "ПФ_MXL_УведомлениеОНачалеОтпуска";
	
КонецФункции

#КонецОбласти

#КонецЕсли
